app/controllers/file_upload_questions_controller.rb

  def index

    @file_upload_questions = FileUploadQuestion.all
---
SELECT "file_upload_questions".* FROM "file_upload_questions"