app/controllers/profiles_controller.rb

  def index

    #     file = File.join(Rails.root, 'app','assets', 'files', 'file1.txt')

    #     all_question=[]

    # # file_data=File.open(file)
    #     index=-1
    #     option_no=1
    #     data=File.foreach(file).map { |line|
    #     if line.include? "QUES"
    #       option_no=1
    #       index=index+1
    #       all_question[index]={}
    #      line= line.split('.')
    #       all_question[index]['question']=line[1].gsub(/\s+/, ' ')
    #     else
    #       if line.include? "("
    #         if line.include? "उत्तर"
    #           all_question[index]["ans"]=line.gsub(/\s+/, ' ')
    #           option_no= option_no+1
    #         else
    #           all_question[index]["options#{option_no}"]=line.gsub(/\s+/, ' ')
    #           option_no= option_no+1
    #         end
    #       end
    #    end
    #   }

    # lattest
      @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles"

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("email", "first_name", "last_name", "phone_no", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "last_name" = ?, "phone_no" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["last_name", "sahni"], ["phone_no", "8456141869"], ["updated_at", "2022-02-15 18:42:56.968107"], ["id", 1]]

    def set_admin
      @admin = Admin.find(params[:admin_id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]