app/controllers/questions_controller.rb

  def index
    if params[:quiz_id].present?
    @questions = Question.where(quiz_id: params[:quiz_id]).paginate(:page => params[:page], :per_page => 5)
    else
      @questions = Question.all.paginate(:page => params[:page], :per_page => 2)
---
SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ? LIMIT ? OFFSET ?  [["quiz_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."quiz_id" = ?  [["quiz_id", 1]]
SELECT "questions".* FROM "questions" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "questions"