app/controllers/subjects_controller.rb

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "English"], ["created_at", "2022-02-17 18:05:13.624013"], ["updated_at", "2022-02-17 18:05:13.624013"]]

  def update
    respond_to do |format|
      if @subject.update(subject_params)
---
UPDATE "subjects" SET "name" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["name", "Hindi2"], ["updated_at", "2022-02-22 14:10:25.975366"], ["id", 2]]