app/models/admin.rb

  def self.from_google(from_google_params)
    create_with(uid: from_google_params[:uid], full_name: from_google_params[:full_name], avatar_url: from_google_params[:avatar_url],password: "test").find_or_create_by!(email: from_google_params[:email])
---
INSERT INTO "admins" ("email", "full_name", "uid", "avatar_url", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "bk147411@gmail.com"], ["LIMIT", 1]]

  def self.from_twitter(twiterparams)
    create_with(uid: twiterparams[:uid], full_name: twiterparams[:full_name], avatar_url: twiterparams[:avatar_url]).find_or_create_by!(email: twiterparams[:email])
---
SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "twiter-test@test.com"], ["LIMIT", 1]]

  def self.sign_up_with_credentials(adminparams)
    Admin.create(full_name: adminparams[:full_name],email: adminparams[:email], phone_number: adminparams[:phone_number], password: adminparams[:password])
---
INSERT INTO "admins" ("email", "full_name", "created_at", "updated_at", "phone_number", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

  def save_profile
    Profile.create_with(first_name: self.full_name,email: self.email,admin: self ).find_or_create_by!(email: self.email)
---
SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "tester@gmail.com"], ["LIMIT", 1]]
INSERT INTO "profiles" ("email", "first_name", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "tester@gmail.com"], ["first_name", "Satish"], ["admin_id", 1], ["created_at", "2022-02-17 19:32:01.503243"], ["updated_at", "2022-02-17 19:32:01.503243"]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."email" = ? LIMIT ?  [["email", "tester@gmail.com"], ["LIMIT", 1]]